
import random

print('')
print('')
print('                               Игра "угадайка" ')
print('')
print('')
print('          Цель игры - угадать цыфру от 1 до 9  ')
print('')
print('			          ps. Не слушай подсказки компьютера...     Enter...')
input('                                                                           Начинаем:')
T = [" попробуй больше", " попробуй меньше", " я даже не знаю что посоветовать",
 "угадал! а не =)))) , давай думай сам", " о смотри потолок падает!!!"]
e = 0
c = 0
while c == 0:
	a = random.randint(1, 9)
	t = random.randint(0,4)
	e += 1
	try:
		b = int(input(' Введи цыфру :'))
	except:
		print(' Лол што ?! Я сам за тебя поставлю сейчас! ')
		b = 0

	if b == a:
		print("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!")
		print()
		print(' Угадал !!! Возьми с полки пирожок! ')
		print()
		print('            у тебя ушло на это', e, 'попыток...')
		print()
		print("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!")
		c = 1
	elif b < 1 or b > 9:
		print(' Перечитай условие: "1 до 9" !!! Эту попытку ты упустил... ')
	elif b > 0 and b < 10:
		print(T[t])
